// Реализовать простую игру "Угадай число";
// Пользователю предлагается выбрать число в диапазоне от 10 до 100
// Пользователь вводит в предложенную форму число
// Программа расчитывает случайное число в диапазоне от 1 до выбранного числа
// Предлагает пользователю 5 попыток угадать загаданное число
// Далее начинается игра
// Пользователь вводит ответ. Если загаданное число меньше, програма выводит инфу о том что число меньше,
// если больше, то соотв. больше. Если пользователь угадывает число, программа поздраляет его с правильынм ответом
// и игра заканчивается
// Если пользователь использует все попытки угадать и не угадывает, то программма сообщает ему о том,
// Что он израсходовал все попытки и игра заканчивается
